zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_PMU_A_Registers.h
//-----------------------------------------------------------------------------
// Copyright 2012 (c) Silicon Laboratories Inc.
//
// SPDX-License-Identifier: Zlib
//
// This siHAL software is provided 'as-is', without any express or implied
// warranty. In no event will the authors be held liable for any damages
// arising from the use of this software.
//
// Permission is granted to anyone to use this software for any purpose,
// including commercial applications, and to alter it and redistribute it
// freely, subject to the following restrictions:
//
// 1. The origin of this software must not be misrepresented; you must not
//    claim that you wrote the original software. If you use this software
//    in a product, an acknowledgment in the product documentation would be
//    appreciated but is not required.
// 2. Altered source versions must be plainly marked as such, and must not be
//    misrepresented as being the original software.
// 3. This notice may not be removed or altered from any source distribution.
//-----------------------------------------------------------------------------
//
// This file applies to the SIM3L1XX_PMU_A module
//
// Script: 0.61
// Version: 1

#ifndef __SI32_PMU_A_REGISTERS_H__
#define __SI32_PMU_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_PMU_A_CONTROL_Struct
{
   union
   {
      struct
      {
         // Wakeup Source Clear
         volatile uint32_t WAKECLR: 1;
                  uint32_t reserved0: 2;
         // Pin Wake Match Enable
         volatile uint32_t PWAKEEN: 1;
         // PMU Asleep Pin Enable
         volatile uint32_t PMUASLPEN: 1;
         // Low Power Charge Pump Voltage Monitor Enable
         volatile uint32_t CPMONEN: 1;
         // Low Power Charge Pump Voltage Monitor Interrupt Enable
         volatile uint32_t CPMONIEN: 1;
                  uint32_t reserved1: 9;
         // RAM 0 Retention Enable
         volatile uint32_t RAM0REN: 1;
         // RAM 1 Retention Enable
         volatile uint32_t RAM1REN: 1;
         // RAM 2 Retention Enable
         volatile uint32_t RAM2REN: 1;
         // RAM 3 Retention Enable
         volatile uint32_t RAM3REN: 1;
         // RAM 4 Retention Enable
         volatile uint32_t RAM4REN: 1;
         // RAM 5 Retention Enable
         volatile uint32_t RAM5REN: 1;
         // RAM 6 Retention Enable
         volatile uint32_t RAM6REN: 1;
         // RAM 7 Retention Enable
         volatile uint32_t RAM7REN: 1;
                  uint32_t reserved2: 8;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PMU_A_CONTROL_WAKECLR_MASK  0x00000001
#define SI32_PMU_A_CONTROL_WAKECLR_SHIFT  0
// Clear all wakeup sources.
#define SI32_PMU_A_CONTROL_WAKECLR_CLEAR_VALUE  0
#define SI32_PMU_A_CONTROL_WAKECLR_CLEAR_U32 \
   (SI32_PMU_A_CONTROL_WAKECLR_CLEAR_VALUE << SI32_PMU_A_CONTROL_WAKECLR_SHIFT)

#define SI32_PMU_A_CONTROL_PWAKEEN_MASK  0x00000008
#define SI32_PMU_A_CONTROL_PWAKEEN_SHIFT  3
// Disable Pin Wake.
#define SI32_PMU_A_CONTROL_PWAKEEN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_PWAKEEN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_PWAKEEN_DISABLED_VALUE << SI32_PMU_A_CONTROL_PWAKEEN_SHIFT)
// Enable Pin Wake.
#define SI32_PMU_A_CONTROL_PWAKEEN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_PWAKEEN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_PWAKEEN_ENABLED_VALUE << SI32_PMU_A_CONTROL_PWAKEEN_SHIFT)

#define SI32_PMU_A_CONTROL_PMUASLPEN_MASK  0x00000010
#define SI32_PMU_A_CONTROL_PMUASLPEN_SHIFT  4
// Disable the PMU Asleep pin.
#define SI32_PMU_A_CONTROL_PMUASLPEN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_PMUASLPEN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_PMUASLPEN_DISABLED_VALUE << SI32_PMU_A_CONTROL_PMUASLPEN_SHIFT)
// Enable the PMU Asleep pin.
#define SI32_PMU_A_CONTROL_PMUASLPEN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_PMUASLPEN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_PMUASLPEN_ENABLED_VALUE << SI32_PMU_A_CONTROL_PMUASLPEN_SHIFT)

#define SI32_PMU_A_CONTROL_CPMONEN_MASK  0x00000020
#define SI32_PMU_A_CONTROL_CPMONEN_SHIFT  5
// Disable the low power charge pump voltage monitor.
#define SI32_PMU_A_CONTROL_CPMONEN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_CPMONEN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_CPMONEN_DISABLED_VALUE << SI32_PMU_A_CONTROL_CPMONEN_SHIFT)
// Enable the low power charge pump voltage monitor.
#define SI32_PMU_A_CONTROL_CPMONEN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_CPMONEN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_CPMONEN_ENABLED_VALUE << SI32_PMU_A_CONTROL_CPMONEN_SHIFT)

#define SI32_PMU_A_CONTROL_CPMONIEN_MASK  0x00000040
#define SI32_PMU_A_CONTROL_CPMONIEN_SHIFT  6
// Disable the low power charge pump voltage monitor interrupt.
#define SI32_PMU_A_CONTROL_CPMONIEN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_CPMONIEN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_CPMONIEN_DISABLED_VALUE << SI32_PMU_A_CONTROL_CPMONIEN_SHIFT)
// Enable the low power charge pump voltage monitor interrupt.
#define SI32_PMU_A_CONTROL_CPMONIEN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_CPMONIEN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_CPMONIEN_ENABLED_VALUE << SI32_PMU_A_CONTROL_CPMONIEN_SHIFT)

#define SI32_PMU_A_CONTROL_RAM0REN_MASK  0x00010000
#define SI32_PMU_A_CONTROL_RAM0REN_SHIFT  16
// Disable power to RAM 0 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM0REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_RAM0REN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM0REN_DISABLED_VALUE << SI32_PMU_A_CONTROL_RAM0REN_SHIFT)
// Enable power to RAM 0 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM0REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_RAM0REN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM0REN_ENABLED_VALUE << SI32_PMU_A_CONTROL_RAM0REN_SHIFT)

#define SI32_PMU_A_CONTROL_RAM1REN_MASK  0x00020000
#define SI32_PMU_A_CONTROL_RAM1REN_SHIFT  17
// Disable power to RAM 1 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM1REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_RAM1REN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM1REN_DISABLED_VALUE << SI32_PMU_A_CONTROL_RAM1REN_SHIFT)
// Enable power to RAM 1 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM1REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_RAM1REN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM1REN_ENABLED_VALUE << SI32_PMU_A_CONTROL_RAM1REN_SHIFT)

#define SI32_PMU_A_CONTROL_RAM2REN_MASK  0x00040000
#define SI32_PMU_A_CONTROL_RAM2REN_SHIFT  18
// Disable power to RAM 2 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM2REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_RAM2REN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM2REN_DISABLED_VALUE << SI32_PMU_A_CONTROL_RAM2REN_SHIFT)
// Enable power to RAM 2 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM2REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_RAM2REN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM2REN_ENABLED_VALUE << SI32_PMU_A_CONTROL_RAM2REN_SHIFT)

