zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_PMU_A_Registers.h
#define SI32_PMU_A_CONTROL_RAM3REN_MASK  0x00080000
#define SI32_PMU_A_CONTROL_RAM3REN_SHIFT  19
// Disable power to RAM 3 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM3REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_RAM3REN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM3REN_DISABLED_VALUE << SI32_PMU_A_CONTROL_RAM3REN_SHIFT)
// Enable power to RAM 3 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM3REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_RAM3REN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM3REN_ENABLED_VALUE << SI32_PMU_A_CONTROL_RAM3REN_SHIFT)

#define SI32_PMU_A_CONTROL_RAM4REN_MASK  0x00100000
#define SI32_PMU_A_CONTROL_RAM4REN_SHIFT  20
// Disable power to RAM 4 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM4REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_RAM4REN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM4REN_DISABLED_VALUE << SI32_PMU_A_CONTROL_RAM4REN_SHIFT)
// Enable power to RAM 4 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM4REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_RAM4REN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM4REN_ENABLED_VALUE << SI32_PMU_A_CONTROL_RAM4REN_SHIFT)

#define SI32_PMU_A_CONTROL_RAM5REN_MASK  0x00200000
#define SI32_PMU_A_CONTROL_RAM5REN_SHIFT  21
// Disable power to RAM 5 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM5REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_RAM5REN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM5REN_DISABLED_VALUE << SI32_PMU_A_CONTROL_RAM5REN_SHIFT)
// Enable power to RAM 5 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM5REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_RAM5REN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM5REN_ENABLED_VALUE << SI32_PMU_A_CONTROL_RAM5REN_SHIFT)

#define SI32_PMU_A_CONTROL_RAM6REN_MASK  0x00400000
#define SI32_PMU_A_CONTROL_RAM6REN_SHIFT  22
// Disable power to RAM 6 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM6REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_RAM6REN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM6REN_DISABLED_VALUE << SI32_PMU_A_CONTROL_RAM6REN_SHIFT)
// Enable power to RAM 6 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM6REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_RAM6REN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM6REN_ENABLED_VALUE << SI32_PMU_A_CONTROL_RAM6REN_SHIFT)

#define SI32_PMU_A_CONTROL_RAM7REN_MASK  0x00800000
#define SI32_PMU_A_CONTROL_RAM7REN_SHIFT  23
// Disable power to RAM 7 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM7REN_DISABLED_VALUE  0
#define SI32_PMU_A_CONTROL_RAM7REN_DISABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM7REN_DISABLED_VALUE << SI32_PMU_A_CONTROL_RAM7REN_SHIFT)
// Enable power to RAM 7 during sleep (4 kB addresses from 0x20000000 to
// 0x20000FFF).
#define SI32_PMU_A_CONTROL_RAM7REN_ENABLED_VALUE  1
#define SI32_PMU_A_CONTROL_RAM7REN_ENABLED_U32 \
   (SI32_PMU_A_CONTROL_RAM7REN_ENABLED_VALUE << SI32_PMU_A_CONTROL_RAM7REN_SHIFT)



struct SI32_PMU_A_CONFIG_Struct
{
   union
   {
      struct
      {
                  uint32_t reserved0: 5;
         // VDRV Switch Mode
         volatile uint32_t VDRVSMD: 2;
                  uint32_t reserved1: 1;
         // Low Power Charge Pump Enable
         volatile uint32_t CPEN: 1;
                  uint32_t reserved2: 1;
         // Charge Pump Load Setting
         volatile uint32_t CPLOAD: 2;
                  uint32_t reserved3: 20;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PMU_A_CONFIG_VDRVSMD_MASK  0x00000060
#define SI32_PMU_A_CONFIG_VDRVSMD_SHIFT  5
// High-Z.
#define SI32_PMU_A_CONFIG_VDRVSMD_HIGHZ_VALUE  0
#define SI32_PMU_A_CONFIG_VDRVSMD_HIGHZ_U32 \
   (SI32_PMU_A_CONFIG_VDRVSMD_HIGHZ_VALUE << SI32_PMU_A_CONFIG_VDRVSMD_SHIFT)
// VBAT connected to VDRV.
#define SI32_PMU_A_CONFIG_VDRVSMD_VBAT_VALUE  2
#define SI32_PMU_A_CONFIG_VDRVSMD_VBAT_U32 \
   (SI32_PMU_A_CONFIG_VDRVSMD_VBAT_VALUE << SI32_PMU_A_CONFIG_VDRVSMD_SHIFT)
// DC-DC output connected to VDRV.
#define SI32_PMU_A_CONFIG_VDRVSMD_VDC_VALUE  3
#define SI32_PMU_A_CONFIG_VDRVSMD_VDC_U32 \
   (SI32_PMU_A_CONFIG_VDRVSMD_VDC_VALUE << SI32_PMU_A_CONFIG_VDRVSMD_SHIFT)

#define SI32_PMU_A_CONFIG_CPEN_MASK  0x00000100
#define SI32_PMU_A_CONFIG_CPEN_SHIFT  8
#define SI32_PMU_A_CONFIG_CPEN_DISABLED_VALUE  0
#define SI32_PMU_A_CONFIG_CPEN_DISABLED_U32 \
   (SI32_PMU_A_CONFIG_CPEN_DISABLED_VALUE << SI32_PMU_A_CONFIG_CPEN_SHIFT)
#define SI32_PMU_A_CONFIG_CPEN_ENABLED_VALUE  1
#define SI32_PMU_A_CONFIG_CPEN_ENABLED_U32 \
   (SI32_PMU_A_CONFIG_CPEN_ENABLED_VALUE << SI32_PMU_A_CONFIG_CPEN_SHIFT)

#define SI32_PMU_A_CONFIG_CPLOAD_MASK  0x00000C00
#define SI32_PMU_A_CONFIG_CPLOAD_SHIFT  10



struct SI32_PMU_A_STATUS_Struct
{
   union
   {
      struct
      {
         // Power Mode 8 Exited Flag
         volatile uint32_t PM8EF: 1;
         // Pin Wake Status Flag
         volatile uint32_t PWAKEF: 1;
         // Power-On Reset Flag
         volatile uint32_t PORF: 1;
         // Low Power Charge Pump Voltage Monitor Status
         volatile uint32_t CPSTS: 1;
                  uint32_t reserved0: 28;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PMU_A_STATUS_PM8EF_MASK  0x00000001
#define SI32_PMU_A_STATUS_PM8EF_SHIFT  0
// The device has not exited Power Mode 8.
#define SI32_PMU_A_STATUS_PM8EF_NOT_SET_VALUE  0
#define SI32_PMU_A_STATUS_PM8EF_NOT_SET_U32 \
   (SI32_PMU_A_STATUS_PM8EF_NOT_SET_VALUE << SI32_PMU_A_STATUS_PM8EF_SHIFT)
// The device has exited Power Mode 8. This bit must be cleared by firmware.
#define SI32_PMU_A_STATUS_PM8EF_SET_VALUE  1
#define SI32_PMU_A_STATUS_PM8EF_SET_U32 \
   (SI32_PMU_A_STATUS_PM8EF_SET_VALUE << SI32_PMU_A_STATUS_PM8EF_SHIFT)

