zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_PMU_A_Registers.h
#define SI32_PMU_A_STATUS_PWAKEF_MASK  0x00000002
#define SI32_PMU_A_STATUS_PWAKEF_SHIFT  1
// No Pin Wake condition is active.
#define SI32_PMU_A_STATUS_PWAKEF_NOT_SET_VALUE  0
#define SI32_PMU_A_STATUS_PWAKEF_NOT_SET_U32 \
   (SI32_PMU_A_STATUS_PWAKEF_NOT_SET_VALUE << SI32_PMU_A_STATUS_PWAKEF_SHIFT)
// A Pin Wake condition is active.
#define SI32_PMU_A_STATUS_PWAKEF_SET_VALUE  1
#define SI32_PMU_A_STATUS_PWAKEF_SET_U32 \
   (SI32_PMU_A_STATUS_PWAKEF_SET_VALUE << SI32_PMU_A_STATUS_PWAKEF_SHIFT)

#define SI32_PMU_A_STATUS_PORF_MASK  0x00000004
#define SI32_PMU_A_STATUS_PORF_SHIFT  2
// A power-on reset did not occur since the last time PORF was cleared.
#define SI32_PMU_A_STATUS_PORF_NOT_SET_VALUE  0
#define SI32_PMU_A_STATUS_PORF_NOT_SET_U32 \
   (SI32_PMU_A_STATUS_PORF_NOT_SET_VALUE << SI32_PMU_A_STATUS_PORF_SHIFT)
// A power-on reset occurred.
#define SI32_PMU_A_STATUS_PORF_SET_VALUE  1
#define SI32_PMU_A_STATUS_PORF_SET_U32 \
   (SI32_PMU_A_STATUS_PORF_SET_VALUE << SI32_PMU_A_STATUS_PORF_SHIFT)

#define SI32_PMU_A_STATUS_CPSTS_MASK  0x00000008
#define SI32_PMU_A_STATUS_CPSTS_SHIFT  3
// The low power charge pump supply voltage is below the threshold.
#define SI32_PMU_A_STATUS_CPSTS_NOT_SET_VALUE  0
#define SI32_PMU_A_STATUS_CPSTS_NOT_SET_U32 \
   (SI32_PMU_A_STATUS_CPSTS_NOT_SET_VALUE << SI32_PMU_A_STATUS_CPSTS_SHIFT)
// The low power charge pump supply voltage is greater than the threshold.
#define SI32_PMU_A_STATUS_CPSTS_SET_VALUE  1
#define SI32_PMU_A_STATUS_CPSTS_SET_U32 \
   (SI32_PMU_A_STATUS_CPSTS_SET_VALUE << SI32_PMU_A_STATUS_CPSTS_SHIFT)



struct SI32_PMU_A_WAKEEN_Struct
{
   union
   {
      struct
      {
         // RTC0 Fail Wake Enable
         volatile uint32_t RTC0FWEN: 1;
         // RTC0 Alarm Wake Enable
         volatile uint32_t RTC0A0WEN: 1;
         // Comparator 0 Wake Enable
         volatile uint32_t CMP0WEN: 1;
         // Advanced Capture Counter 0 Wake Enable
         volatile uint32_t ACC0WEN: 1;
         // LCD VBAT Voltage Monitor Wake Enable
         volatile uint32_t LCDMONWEN: 1;
         // Pin Wake Wake Enable
         volatile uint32_t PWAKEWEN: 1;
         // Low Power Timer Wake Enable
         volatile uint32_t LPT0WEN: 1;
         // UART0 Wake Enable
         volatile uint32_t UART0WEN: 1;
         // Low Power Charge Pump Supply Fail Wake Enable
         volatile uint32_t CPFWEN: 1;
                  uint32_t reserved0: 23;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PMU_A_WAKEEN_RTC0FWEN_MASK  0x00000001
#define SI32_PMU_A_WAKEEN_RTC0FWEN_SHIFT  0
// An RTC0 Fail event does not wake the device.
#define SI32_PMU_A_WAKEEN_RTC0FWEN_DISABLED_VALUE  0
#define SI32_PMU_A_WAKEEN_RTC0FWEN_DISABLED_U32 \
   (SI32_PMU_A_WAKEEN_RTC0FWEN_DISABLED_VALUE << SI32_PMU_A_WAKEEN_RTC0FWEN_SHIFT)
// An RTC0 Fail event awakens the device.
#define SI32_PMU_A_WAKEEN_RTC0FWEN_ENABLED_VALUE  1
#define SI32_PMU_A_WAKEEN_RTC0FWEN_ENABLED_U32 \
   (SI32_PMU_A_WAKEEN_RTC0FWEN_ENABLED_VALUE << SI32_PMU_A_WAKEEN_RTC0FWEN_SHIFT)

#define SI32_PMU_A_WAKEEN_RTC0A0WEN_MASK  0x00000002
#define SI32_PMU_A_WAKEEN_RTC0A0WEN_SHIFT  1
// An RTC0 Alarm event does not wake the device.
#define SI32_PMU_A_WAKEEN_RTC0A0WEN_DISABLED_VALUE  0
#define SI32_PMU_A_WAKEEN_RTC0A0WEN_DISABLED_U32 \
   (SI32_PMU_A_WAKEEN_RTC0A0WEN_DISABLED_VALUE << SI32_PMU_A_WAKEEN_RTC0A0WEN_SHIFT)
// An RTC0 Alarm event awakens the device.
#define SI32_PMU_A_WAKEEN_RTC0A0WEN_ENABLED_VALUE  1
#define SI32_PMU_A_WAKEEN_RTC0A0WEN_ENABLED_U32 \
   (SI32_PMU_A_WAKEEN_RTC0A0WEN_ENABLED_VALUE << SI32_PMU_A_WAKEEN_RTC0A0WEN_SHIFT)

#define SI32_PMU_A_WAKEEN_CMP0WEN_MASK  0x00000004
#define SI32_PMU_A_WAKEEN_CMP0WEN_SHIFT  2
// A Comparator 0 event does not wake the device.
#define SI32_PMU_A_WAKEEN_CMP0WEN_DISABLED_VALUE  0
#define SI32_PMU_A_WAKEEN_CMP0WEN_DISABLED_U32 \
   (SI32_PMU_A_WAKEEN_CMP0WEN_DISABLED_VALUE << SI32_PMU_A_WAKEEN_CMP0WEN_SHIFT)
// A Comparator 0 event awakens the device.
#define SI32_PMU_A_WAKEEN_CMP0WEN_ENABLED_VALUE  1
#define SI32_PMU_A_WAKEEN_CMP0WEN_ENABLED_U32 \
   (SI32_PMU_A_WAKEEN_CMP0WEN_ENABLED_VALUE << SI32_PMU_A_WAKEEN_CMP0WEN_SHIFT)

#define SI32_PMU_A_WAKEEN_ACC0WEN_MASK  0x00000008
#define SI32_PMU_A_WAKEEN_ACC0WEN_SHIFT  3
// An Advanced Capture Counter (ACCTR0) event does not wake the device.
#define SI32_PMU_A_WAKEEN_ACC0WEN_DISABLED_VALUE  0
#define SI32_PMU_A_WAKEEN_ACC0WEN_DISABLED_U32 \
   (SI32_PMU_A_WAKEEN_ACC0WEN_DISABLED_VALUE << SI32_PMU_A_WAKEEN_ACC0WEN_SHIFT)
// An Advanced Capture Counter (ACCTR0) event awakens the device.
#define SI32_PMU_A_WAKEEN_ACC0WEN_ENABLED_VALUE  1
#define SI32_PMU_A_WAKEEN_ACC0WEN_ENABLED_U32 \
   (SI32_PMU_A_WAKEEN_ACC0WEN_ENABLED_VALUE << SI32_PMU_A_WAKEEN_ACC0WEN_SHIFT)

#define SI32_PMU_A_WAKEEN_LCDMONWEN_MASK  0x00000010
#define SI32_PMU_A_WAKEEN_LCDMONWEN_SHIFT  4
// An LCD VBAT voltage monitor event does not wake the device.
#define SI32_PMU_A_WAKEEN_LCDMONWEN_DISABLED_VALUE  0
#define SI32_PMU_A_WAKEEN_LCDMONWEN_DISABLED_U32 \
   (SI32_PMU_A_WAKEEN_LCDMONWEN_DISABLED_VALUE << SI32_PMU_A_WAKEEN_LCDMONWEN_SHIFT)
// An LCD VBAT voltage monitor event awakens the device.
#define SI32_PMU_A_WAKEEN_LCDMONWEN_ENABLED_VALUE  1
#define SI32_PMU_A_WAKEEN_LCDMONWEN_ENABLED_U32 \
   (SI32_PMU_A_WAKEEN_LCDMONWEN_ENABLED_VALUE << SI32_PMU_A_WAKEEN_LCDMONWEN_SHIFT)

#define SI32_PMU_A_WAKEEN_PWAKEWEN_MASK  0x00000020
#define SI32_PMU_A_WAKEEN_PWAKEWEN_SHIFT  5
// A Pin Wake event does not wake the device.
#define SI32_PMU_A_WAKEEN_PWAKEWEN_DISABLED_VALUE  0
#define SI32_PMU_A_WAKEEN_PWAKEWEN_DISABLED_U32 \
   (SI32_PMU_A_WAKEEN_PWAKEWEN_DISABLED_VALUE << SI32_PMU_A_WAKEEN_PWAKEWEN_SHIFT)
// A Pin Wake event awakens the device.
#define SI32_PMU_A_WAKEEN_PWAKEWEN_ENABLED_VALUE  1
#define SI32_PMU_A_WAKEEN_PWAKEWEN_ENABLED_U32 \
   (SI32_PMU_A_WAKEEN_PWAKEWEN_ENABLED_VALUE << SI32_PMU_A_WAKEEN_PWAKEWEN_SHIFT)

#define SI32_PMU_A_WAKEEN_LPT0WEN_MASK  0x00000040
#define SI32_PMU_A_WAKEEN_LPT0WEN_SHIFT  6
// An LPTIMER0 event does not wake the device.
#define SI32_PMU_A_WAKEEN_LPT0WEN_DISABLED_VALUE  0
#define SI32_PMU_A_WAKEEN_LPT0WEN_DISABLED_U32 \
   (SI32_PMU_A_WAKEEN_LPT0WEN_DISABLED_VALUE << SI32_PMU_A_WAKEEN_LPT0WEN_SHIFT)
// An LPTIMER0 event awakens the device.
#define SI32_PMU_A_WAKEEN_LPT0WEN_ENABLED_VALUE  1
#define SI32_PMU_A_WAKEEN_LPT0WEN_ENABLED_U32 \
   (SI32_PMU_A_WAKEEN_LPT0WEN_ENABLED_VALUE << SI32_PMU_A_WAKEEN_LPT0WEN_SHIFT)

