zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_PMU_A_Registers.h
#define SI32_PMU_A_WAKEEN_UART0WEN_MASK  0x00000080
#define SI32_PMU_A_WAKEEN_UART0WEN_SHIFT  7
// A UART0 event does not wake the device.
#define SI32_PMU_A_WAKEEN_UART0WEN_DISABLED_VALUE  0
#define SI32_PMU_A_WAKEEN_UART0WEN_DISABLED_U32 \
   (SI32_PMU_A_WAKEEN_UART0WEN_DISABLED_VALUE << SI32_PMU_A_WAKEEN_UART0WEN_SHIFT)
// A UART0 event awakens the device.
#define SI32_PMU_A_WAKEEN_UART0WEN_ENABLED_VALUE  1
#define SI32_PMU_A_WAKEEN_UART0WEN_ENABLED_U32 \
   (SI32_PMU_A_WAKEEN_UART0WEN_ENABLED_VALUE << SI32_PMU_A_WAKEEN_UART0WEN_SHIFT)

#define SI32_PMU_A_WAKEEN_CPFWEN_MASK  0x00000100
#define SI32_PMU_A_WAKEEN_CPFWEN_SHIFT  8
// A low power charge pump supply fail event does not wake the device.
#define SI32_PMU_A_WAKEEN_CPFWEN_DISABLED_VALUE  0
#define SI32_PMU_A_WAKEEN_CPFWEN_DISABLED_U32 \
   (SI32_PMU_A_WAKEEN_CPFWEN_DISABLED_VALUE << SI32_PMU_A_WAKEEN_CPFWEN_SHIFT)
// A low power charge pump supply fail event awakens the device.
#define SI32_PMU_A_WAKEEN_CPFWEN_ENABLED_VALUE  1
#define SI32_PMU_A_WAKEEN_CPFWEN_ENABLED_U32 \
   (SI32_PMU_A_WAKEEN_CPFWEN_ENABLED_VALUE << SI32_PMU_A_WAKEEN_CPFWEN_SHIFT)



struct SI32_PMU_A_WAKESTATUS_Struct
{
   union
   {
      struct
      {
         // RTC0 Fail Wake Flag
         volatile uint32_t RTC0FWF: 1;
         // RTC0 Alarm Wake Flag
         volatile uint32_t RTC0A0WF: 1;
         // Comparator 0 Wake Flag
         volatile uint32_t CMP0WF: 1;
         // Advanced Capture Counter 0 Wake Flag
         volatile uint32_t ACC0WF: 1;
         // LCD VBAT Voltage Monitor Wake Flag
         volatile uint32_t LCDMONWF: 1;
         // Pin Wake Wake Flag
         volatile uint32_t PWAKEWF: 1;
         // Low Power Timer Wake Flag
         volatile uint32_t LPT0WF: 1;
         // UART0 Wake Flag
         volatile uint32_t UART0WF: 1;
         // Low Power Charge Pump Supply Fail Wake Flag
         volatile uint32_t CPFWF: 1;
         // Reset Pin Wake Flag
         volatile uint32_t RSTWF: 1;
                  uint32_t reserved0: 22;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PMU_A_WAKESTATUS_RTC0FWF_MASK  0x00000001
#define SI32_PMU_A_WAKESTATUS_RTC0FWF_SHIFT  0
// An RTC0 Fail event did not wake the device.
#define SI32_PMU_A_WAKESTATUS_RTC0FWF_NOT_SET_VALUE  0
#define SI32_PMU_A_WAKESTATUS_RTC0FWF_NOT_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_RTC0FWF_NOT_SET_VALUE << SI32_PMU_A_WAKESTATUS_RTC0FWF_SHIFT)
// An RTC0 Fail event woke the device.
#define SI32_PMU_A_WAKESTATUS_RTC0FWF_SET_VALUE  1
#define SI32_PMU_A_WAKESTATUS_RTC0FWF_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_RTC0FWF_SET_VALUE << SI32_PMU_A_WAKESTATUS_RTC0FWF_SHIFT)

#define SI32_PMU_A_WAKESTATUS_RTC0A0WF_MASK  0x00000002
#define SI32_PMU_A_WAKESTATUS_RTC0A0WF_SHIFT  1
// An RTC0 Alarm event did not wake the device.
#define SI32_PMU_A_WAKESTATUS_RTC0A0WF_NOT_SET_VALUE  0
#define SI32_PMU_A_WAKESTATUS_RTC0A0WF_NOT_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_RTC0A0WF_NOT_SET_VALUE << SI32_PMU_A_WAKESTATUS_RTC0A0WF_SHIFT)
// An RTC0 Alarm event woke the device.
#define SI32_PMU_A_WAKESTATUS_RTC0A0WF_SET_VALUE  1
#define SI32_PMU_A_WAKESTATUS_RTC0A0WF_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_RTC0A0WF_SET_VALUE << SI32_PMU_A_WAKESTATUS_RTC0A0WF_SHIFT)

#define SI32_PMU_A_WAKESTATUS_CMP0WF_MASK  0x00000004
#define SI32_PMU_A_WAKESTATUS_CMP0WF_SHIFT  2
// A Comparator 0 event did not wake the device.
#define SI32_PMU_A_WAKESTATUS_CMP0WF_NOT_SET_VALUE  0
#define SI32_PMU_A_WAKESTATUS_CMP0WF_NOT_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_CMP0WF_NOT_SET_VALUE << SI32_PMU_A_WAKESTATUS_CMP0WF_SHIFT)
// A Comparator 0 event woke the device.
#define SI32_PMU_A_WAKESTATUS_CMP0WF_SET_VALUE  1
#define SI32_PMU_A_WAKESTATUS_CMP0WF_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_CMP0WF_SET_VALUE << SI32_PMU_A_WAKESTATUS_CMP0WF_SHIFT)

#define SI32_PMU_A_WAKESTATUS_ACC0WF_MASK  0x00000008
#define SI32_PMU_A_WAKESTATUS_ACC0WF_SHIFT  3
// An Advanced Capture Counter (ACCTR0) event did not wake the device.
#define SI32_PMU_A_WAKESTATUS_ACC0WF_NOT_SET_VALUE  0
#define SI32_PMU_A_WAKESTATUS_ACC0WF_NOT_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_ACC0WF_NOT_SET_VALUE << SI32_PMU_A_WAKESTATUS_ACC0WF_SHIFT)
// An Advanced Capture Counter (ACCTR0) event woke the device.
#define SI32_PMU_A_WAKESTATUS_ACC0WF_SET_VALUE  1
#define SI32_PMU_A_WAKESTATUS_ACC0WF_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_ACC0WF_SET_VALUE << SI32_PMU_A_WAKESTATUS_ACC0WF_SHIFT)

#define SI32_PMU_A_WAKESTATUS_LCDMONWF_MASK  0x00000010
#define SI32_PMU_A_WAKESTATUS_LCDMONWF_SHIFT  4
// A LCD VBAT voltage monitor event did not wake the device.
#define SI32_PMU_A_WAKESTATUS_LCDMONWF_NOT_SET_VALUE  0
#define SI32_PMU_A_WAKESTATUS_LCDMONWF_NOT_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_LCDMONWF_NOT_SET_VALUE << SI32_PMU_A_WAKESTATUS_LCDMONWF_SHIFT)
// A LCD VBAT voltage monitor event woke the device.
#define SI32_PMU_A_WAKESTATUS_LCDMONWF_SET_VALUE  1
#define SI32_PMU_A_WAKESTATUS_LCDMONWF_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_LCDMONWF_SET_VALUE << SI32_PMU_A_WAKESTATUS_LCDMONWF_SHIFT)

#define SI32_PMU_A_WAKESTATUS_PWAKEWF_MASK  0x00000020
#define SI32_PMU_A_WAKESTATUS_PWAKEWF_SHIFT  5
// A Pin Wake event did not wake the device.
#define SI32_PMU_A_WAKESTATUS_PWAKEWF_NOT_SET_VALUE  0
#define SI32_PMU_A_WAKESTATUS_PWAKEWF_NOT_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_PWAKEWF_NOT_SET_VALUE << SI32_PMU_A_WAKESTATUS_PWAKEWF_SHIFT)
// A Pin Wake event woke the device.
#define SI32_PMU_A_WAKESTATUS_PWAKEWF_SET_VALUE  1
#define SI32_PMU_A_WAKESTATUS_PWAKEWF_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_PWAKEWF_SET_VALUE << SI32_PMU_A_WAKESTATUS_PWAKEWF_SHIFT)

#define SI32_PMU_A_WAKESTATUS_LPT0WF_MASK  0x00000040
#define SI32_PMU_A_WAKESTATUS_LPT0WF_SHIFT  6
// An LPTIMER0 event did not wake the device.
#define SI32_PMU_A_WAKESTATUS_LPT0WF_NOT_SET_VALUE  0
#define SI32_PMU_A_WAKESTATUS_LPT0WF_NOT_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_LPT0WF_NOT_SET_VALUE << SI32_PMU_A_WAKESTATUS_LPT0WF_SHIFT)
// An LPTIMER0 event woke the device.
#define SI32_PMU_A_WAKESTATUS_LPT0WF_SET_VALUE  1
#define SI32_PMU_A_WAKESTATUS_LPT0WF_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_LPT0WF_SET_VALUE << SI32_PMU_A_WAKESTATUS_LPT0WF_SHIFT)

#define SI32_PMU_A_WAKESTATUS_UART0WF_MASK  0x00000080
#define SI32_PMU_A_WAKESTATUS_UART0WF_SHIFT  7
// A UART0 event did not wake the device.
#define SI32_PMU_A_WAKESTATUS_UART0WF_NOT_SET_VALUE  0
#define SI32_PMU_A_WAKESTATUS_UART0WF_NOT_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_UART0WF_NOT_SET_VALUE << SI32_PMU_A_WAKESTATUS_UART0WF_SHIFT)
// A UART0 event woke the device.
#define SI32_PMU_A_WAKESTATUS_UART0WF_SET_VALUE  1
#define SI32_PMU_A_WAKESTATUS_UART0WF_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_UART0WF_SET_VALUE << SI32_PMU_A_WAKESTATUS_UART0WF_SHIFT)

#define SI32_PMU_A_WAKESTATUS_CPFWF_MASK  0x00000100
#define SI32_PMU_A_WAKESTATUS_CPFWF_SHIFT  8
// A low power charge pump supply fail event did not wake the device.
#define SI32_PMU_A_WAKESTATUS_CPFWF_NOT_SET_VALUE  0
#define SI32_PMU_A_WAKESTATUS_CPFWF_NOT_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_CPFWF_NOT_SET_VALUE << SI32_PMU_A_WAKESTATUS_CPFWF_SHIFT)
// A low power charge pump supply fail event woke the device.
#define SI32_PMU_A_WAKESTATUS_CPFWF_SET_VALUE  1
#define SI32_PMU_A_WAKESTATUS_CPFWF_SET_U32 \
   (SI32_PMU_A_WAKESTATUS_CPFWF_SET_VALUE << SI32_PMU_A_WAKESTATUS_CPFWF_SHIFT)

